{
    "model_config": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential",
            "layers": [
                {
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            28,
                            28,
                            1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "conv2d_input"
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            28,
                            28,
                            1
                        ],
                        "dtype": "float32",
                        "filters": 16,
                        "kernel_size": [
                            5,
                            5
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d",
                        "trainable": true,
                        "dtype": "float32",
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 36,
                        "kernel_size": [
                            5,
                            5
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.25,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 128,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_1",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 10,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }
            ]
        }
    },
    "conv2d": {
        "kernel": [
            [
                [
                    [
                        0.1948907,
                        -0.1469393,
                        0.1662046,
                        -0.02677367,
                        -0.03027689,
                        0.1786462,
                        -0.3018703,
                        -0.0548023,
                        0.0658526,
                        -0.03068631,
                        0.00380251,
                        -0.06318951,
                        0.07389051,
                        -0.0759422,
                        0.03911677,
                        -0.1319429
                    ]
                ],
                [
                    [
                        0.2043286,
                        0.07758481,
                        0.008608708,
                        0.07047542,
                        0.1758524,
                        0.0571444,
                        -0.09397005,
                        -0.06928222,
                        0.05773503,
                        0.01126046,
                        0.1702955,
                        -0.2504882,
                        -0.06492312,
                        0.09029056,
                        -0.07407459,
                        -0.1285498
                    ]
                ]
            ]
        ],
        "bias": [
            0.01278729,
            -0.03275592,
            0.03394251,
            0.0198399,
            -0.003167976,
            -0.03529014,
            -0.0108353,
            -0.009330078,
            0.004204504,
            -0.02869095,
            -0.001051644,
            0.01676617,
            -0.04315347,
            -0.02340599,
            0.007878375,
            -0.001764285
        ]
    }
}